Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/App_Dictionaries.po
Languages: fr

source: Dictionaries
fr: Dictionnaires

source: How to download and install dictionaries
fr: Comment télécharger et installer des dictionnaires

source: Dictionaries in OmegaT are based on the StarDict or on the Lingvo DSL format. To install the necessary files for the StarDict format, proceed as follows:
fr: Les dictionnaires dans OmegaT utilisent les formats StarDict ou Lingvo DSL. Pour installer les fichiers nécessaires au format StarDict, procédez comme suit :

source: Search for the required language combination - for instance on the `dictionary links given by the OmegaT Wiki <https://sourceforge.net/p/omegat/wiki/Reference%20Material/>`__.
fr: Recherchez la combinaison de langue désirée – par exemple en suivant les `liens vers les dictionnaires donnés par le Wiki d'OmegaT <https://sourceforge.net/p/omegat/wiki/Reference%20Material/>`__.

source: Download the file - it should be a ``tarball`` archive (extension *tar.bz* or *tar.bz2*).
fr: Téléchargez le fichier. Ce devrait être un fichier d'archive ``tarball`` (extension*tar.bz* ou *tar.bz2*).

source: Use untar utility (or its equivalent, for instance ``winrar`` in Windows) to extract its contents into the project folder "Dictionary". There should be three files, with extensions *dz*, *idx* and *ifo*.
fr: Utilisez l'utilitaire de désarchivage ``untar`` (ou l'un de ses équivalents, par exemple ``winrar`` pour Windows) pour extraire le contenu du fichier dans le dossier « dictionnary » (dictionnaire) du projet. Trois fichiers comportant les extensions *dz*, *idx* et *ifo* doivent s'y trouver.

source: Note that in addition to "source-target" dictionaries you can, using the Dictionary feature, obtain access to information such as:
fr: Veuillez noter qu'en plus des dictionnaires « source-cible », vous pouvez, en utilisant la fonction Dictionnaire, avoir accès à des informations telles que :

source: Some of the dictionaries have no strings attached - i.e. are "Free to use", and others, like the selection above, are under the GPL license. The following example shows Merriam Webster 10th dictionary "in action":
fr: Certains dictionnaires sont accessibles sans conditions (ou « libres d'usage ») tandis que d'autres (comme la sélection ci-dessus) sont soumis à la Licence GNU. L'exemple suivant montre le dictionnaire Merriam Webster 10th « en action » :

source: Merriam Webster dictionary - use
fr: Utilisation du dictionnaire Merriam Webster

source: Problems with dictionaries
fr: Problèmes rencontrés concernant les dictionnaires

source: Check that your dict files are in the correct folder (or in a subfolder below it). Check in Project > Properties.
fr: Vérifiez que vos fichiers dictionnaire sont dans le bon dossier (ou à l'intérieur de ce dossier dans un sous-dossier). Vérifiez dans Projet > Propriétés.

source: Does the folder contain three files of the same name, with extensions? If only one file is present, check its extension. If it is *tar.bz*, you have forgotten to unpack (untar) it.
fr: Le dossier contient-il trois fichiers du même nom avec des extensions ? Si un seul fichier est présent, vérifiez son extension. S'il s'agit de *tar.bz*, cela signifie que vous avez oublié de le décompresser (désarchiver).
