Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/App_Glossaries.po
Languages: fr

source: Glossaries
fr: Glossaires

source: You define its location and name in the project properties dialog. The extension must be ``.txt`` or ``.utf8`` (if not, it will be added). The location of the file must be within the ``/glossary`` folder, but it can be in a deeper folder (e.g., ``glossary/sub/glossary.txt``). The file does not need to exist when setting it, it will be created (if necessary) when adding a glossary entry. If the file already exists, no attempt is done to verify the format or the character set of the file: the new entries will always be in tab-separated format and UTF-8. As the existing content will not be touched, damage to an existing file would be limited.
fr: Vous pouvez définir son emplacement et son nom dans la boite de dialogue des propriétés du projet. The extension must be ``.txt`` or ``.utf8`` (if not, it will be added). The location of the file must be within the ``/glossary`` folder, but it can be in a deeper folder (e.g., ``glossary/sub/glossary.txt``). Il n'est pas nécessaire que le fichier existe au moment de la configuration, il sera créé (si besoin est) au moment de l'ajout d'une entrée de glossaire. Si le fichier existe déjà, il n'y a pas de vérification du format ou du jeu caractères du fichier : les nouvelles entrées sont toujours présentées sous format texte séparé par des tabulations et en UTF-8. Dans la mesure où le contenu existant n'est pas touché, il y a peu de risque de commettre des erreurs dans le fichier existant.

source: Usage
fr: Utilisation

source: Glossary pane
fr: Volet Glossaires

source: The word before the = sign is the source term, and its translation is (or are) the words after =. The vocabulary entry can have a comment added. The glossary function only finds exact matches with the glossary entry (e.g. does not find inflected forms etc.). New terms can be added manually to the glossary file(s) during translation, for example in a text editor. Newly added terms will not be recognized once the changes in the text file have been saved.
fr: Les mots écrits avant le signe « = » sont les termes source, et le ou les mots écrits après « = » correspondent à leurs traductions. L'entrée vocabulaire peut avoir un ou plusieurs commentaires ajoutés. La fonction glossaire ne trouve que les mots qui correspondent exactement aux entrées du glossaire (par exemple, il ne reconnaît pas les formes accordées). De nouveaux termes peuvent être ajoutés manuellement au(x) fichier(s) glossaire pendant la traduction en utilisant, par exemple, un éditeur de texte. Les termes nouvellement ajoutés ne sont reconnus qu'une fois les changements du fichier texte enregistrés.

source: The source term does not have to be a single-word item, as the next example shows:
fr: Un terme source ne doit pas nécessairement être un mot seul. Comme dans cet exemple :

source: multiple words entries in glossaries - example
fr: Les entrées à plusieurs mots dans les glossaires – exemple

source: The underlined item "pop-up menu" can be found in the glossary pane as "pojavni menu". Highlighting it in the Glossary pane and then rightclicking insets at the cursor position in the target segment. [1]_
fr: L'élément souligné « free software » figure dans le volet Glossaires face à « logiciel libre ». Surlignez ce mot dans le volet Glossaires et faites un clic droit dessus après avoir placé le curseur à la bonne position dans le segment cible. [1]_

source: File format
fr: Format de fichier

source: Glossary files are simple plain text files containing three-column, tab-delimited lists with the source and target terms in the first and second columns respectively. The third column can be used for additional information. You can have entries with the target column missing, i.e. just containing the source term and the comment.
fr: Les fichiers glossaire sont de simples fichiers texte brut contenant trois colonnes, formant des listes délimitées par tabulation avec les termes source et cible situés respectivement dans la première et la deuxième colonne. La troisième colonne peut être utilisée pour insérer des informations complémentaires. Il est possible de créer des entrées avec une colonne cible vide, c.-à-d. contenant seulement le terme source et le commentaire.

source: The encoding of glossaries is determined automatically. Of course, the encoding must be compatible with both the languages contained, so Unicode is recommended.
fr: L'encodage des glossaires est déterminé automatiquement. Comme il faut bien sûr qu'il soit compatible avec les deux langues impliquées, Unicode est recommandé.

source: Also supported is the CSV format. This format is the same as the tab separated one: source term, target term. Comment fields are separated by a comma ','. Strings can be enclosed by quotes ", which allows having a comma inside a string:
fr: Le format CSV est également pris en charge. Ce format est le même que celui à séparation par tabulation : terme source, terme cible. Les champs de commentaire sont séparés par une virgule. Les chaînes de caractères peuvent être encadrées par des guillemets, ce qui permet d'inclure des virgules à l'intérieur des chaînes de caractères :

source: TBX - Term Base eXchange - is the open, XML-based standard for exchanging structured terminological data, TBX has been approved as an international standard by LISA and ISO. If you have an existing terminology handling system it is quite possible it offers the export of terminology data via TBX format. `Microsoft Terminology Collection <http://www.microsoft.com/Language/en-US/Terminology.aspx>`__ can be downloaded in nearly 100 languages and can serve as a cornerstone IT glossary.
fr: Le TBX (Term Base eXchange), est le standard libre basé sur XML utilisé pour l'échange de données terminologiques structurées. TBX a été approuvé, en tant que standard international, par LISA et ISO. Si vous possédez déjà un système de gestion de la terminologie, il est possible que celui-ci propose une exportation des données terminologiques via le format TBX. `Microsoft Terminology Collection <http://www.microsoft.com/Language/en-US/Terminology.aspx>`__ can be downloaded in nearly 100 languages and can serve as a cornerstone IT glossary.

source: How to create glossaries
fr: Création des glossaires

source: The project setting allows one to enter a name for a writable glossary file (see beginning of this chapter). Right-click in the glossary pane or press Ctrl+Shift+G to add a new entry. A dialog opens, allowing you to enter the source term, target term and any comments you may have:
fr: Le paramétrage du projet vous permet d'entrer un nom de fichier glossaire modifiable (voir début de ce chapitre). Right-click in the glossary pane or press Ctrl+Shift+G to add a new entry. Une boite de dialogue s'ouvre, vous permettant d'entrer le terme source, le terme cible et tous les commentaires que vous pourriez avoir :

source: The contents of glossary files are kept in memory and are loaded when the project is opened or reloaded. Updating a glossary file is thus rather simple: press Ctrl+Shift+G and enter the new term, its translation and any comments you may have (ensuring you press tab between the fields) and save the file. The contents of the glossary pane will be updated accordingly.
fr: Le contenu des fichiers glossaire est gardé en mémoire et chargé lorsque le projet est ouvert ou rechargé. Updating a glossary file is thus rather simple: press Ctrl+Shift+G and enter the new term, its translation and any comments you may have (ensuring you press tab between the fields) and save the file. Le contenu du volet Glossaires sera mis à jour en conséquence.

source: Priority glossary
fr: Glossaire prioritaire

source: The results from the priority glossary (by default, glossary/glossary.txt) appear in first places in the Glossary pane and in TransTips.
fr: Les résultats du glossaire prioritaire (par défaut, glossary/glossary.txt) apparaissent en premier dans l'onglet Glossaires et dans les TransTips.

source: As entries can mix words from priority and non priority glossaries, the words from the priority glossary are displayed in bold.
fr: Les entrées pouvant mélanger des mots de glossaires prioritaires et non prioritaires, les mots du glossaire prioritaires sont affichés en gras.

source: Common glossary problems
fr: Problèmes de glossaire les plus courants

source: No glossary file found in the "glossary" folder.
fr: Aucun fichier glossaire n'a été trouvé dans le dossier « glossary ».

source: The glossary file is empty.
fr: Le fichier glossaire est vide.

source: The items are not separated with a TAB character.
fr: Les éléments ne sont pas séparés par le caractère TAB.

source: The glossary file does not have the correct extension (.tab, .utf8 or .txt).
fr: Le fichier glossaire ne possède pas la bonne extension (.tab, .utf8 ou .txt).

source: There is no EXACT match between the glossary entry and the source text in your document - for instance plurals.
fr: Il n'y a pas de correspondance EXACTE entre l'entrée glossaire et le texte source de votre document (exemple : différence singulier/pluriel).

source: The glossary file does not have the correct encoding.
fr: Le fichier glossaire ne possède pas l'encodage adéquat.

source: There are no terms in the current segment which match any terms in the glossary.
fr: Aucun terme dans le segment en cours ne correspond à un terme du glossaire.

source: One or more of the above problems may have been fixed, but the project has not been reloaded.
fr: Un ou plusieurs des problèmes ci-dessus ont été résolus mais le projet n'a pas été rechargé.

source: ...but the same characters are displayed properly in the Editing pane: the extension and the file encoding do not match.
fr: ...mais les mêmes caractères sont affichés correctement dans le volet Éditeur : l'extension et le codage du fichier ne correspondent pas.

source: Note that in the above case, this is just half (or even less) of the story, as the target language (Slovenian) uses declension. So the inserted "pojavni meni" in the nominative form - has to be changed to "pojavnem meniju" , i.e. to the locative. So it is probably faster to type the term correctly right away without bothering with the glossary and its shortcuts.
fr: Pour insérer des termes du glossaire, il est également possible d'effectuer un clic droit sur la partie soulignée en bleu dans le segment source et de choisir le terme correspondant.
