Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/Dialogs_ProjectProperties.po
Languages: fr

source: Languages
fr: Langues

source: You can either enter the source and target languages by hand or use the drop down menus. Bear in mind that changing the languages may render the currently used translation memories useless since their language pair may not longer match the new languages.
fr: Vous pouvez entrer les langues cible et source à la main ou utiliser les menus déroulants. Gardez à l'esprit que la modification des langues peut rendre les mémoires de traduction actuellement utilisées inutiles puisque leurs paires de langues peuvent ne plus correspondre aux nouvelles langues.

source: Tokenizers corresponding to the selected languages are displayed.
fr: Les lemmatiseurs correspondant aux langues sélectionnées sont affichés.

source: Enable Sentence-level segmentation
fr: Activer la segmentation par phrase

source: The segmentation settings only address the way the source files are handled by OmegaT. The predominant way of segmenting the sources is the sentence-level segmenting, so this check box should in a normal case be left checked.
fr: The segmentation settings only address the way the source files are handled by OmegaT. La façon la plus courante de segmenter les fichiers est la segmentation par phrase. En temps normal, cette case doit donc rester cochée.

source: In some seldom cases the alternative, i.e. segmenting by paragraphs, may be preferred. Changing this flag does not modify the segmentation of already existing translation memories. If you decide mid-translation to switch from sentence to paragraph translation, the internal translation memory of the project will not be changed (OmegaT may upgrade old translation memories that did not use sentence segmentation, but not vice versa), but OmegaT will attempt to create paragraph fuzzy matches by gluing together existing sentence translations.
fr: Mais dans certains cas isolés, l'alternative (soit la segmentation par paragraphe) peut être préférée. La modification de ce marqueur ne modifie pas la segmentation des mémoires de traduction déjà existantes. If you decide mid-translation to switch from sentence to paragraph translation, the internal translation memory of the project will not be changed (OmegaT may upgrade old translation memories that did not use sentence segmentation, but not vice versa), but OmegaT will attempt to create paragraph fuzzy matches by gluing together existing sentence translations.

source: Changing segmentation settings may cause some already translated segments to be split or merged. This will effectively return them to the "untranslated" status, as they will no longer match segments recorded in the project memory, even though their original translation is still there.
fr: La modification des paramètres de segmentation peut entraîner la séparation ou la fusion de segments déjà traduits. Dans les faits, cela va les faire revenir au statut de « non traduits » puisqu'ils ne correspondront plus aux segments enregistrés dans la mémoire du projet, même si leur traduction de départ y est toujours présente.

source: Auto-propagation of Translations
fr: Propagation automatique des traductions

source: In case there are non-unique segments in source documents, the Auto-propagation check box offers the user the following two possibilities as regards automatic translation: if checked, the first translated segment will be assumed as the default translation and its target text will be automatically used for later hits during the translation process. Mistranslated segments can of course be corrected later manually using Create Alternative Translation. If the Auto-propagation check box is not checked, the segments with alternative translations are left untranslated until the user has decided which translation is to be used.
fr: Dans le cas où il existerait des segments non uniques dans les documents source, la case Propagation automatique des traductions donne à l'utilisateur les deux possibilités suivantes concernant la traduction automatique : si la case est cochée, le premier segment traduit sera considéré comme la traduction par défaut et son texte cible sera automatiquement utilisé pour les segments identiques suivants durant le processus de traduction. Mistranslated segments can of course be corrected later manually using Create Alternative Translation. Si la case Propagation automatique des traductions n'est pas cochée, les segments ayant des traductions alternatives ne seront pas traduits jusqu'à ce que l'utilisateur décide du choix de la traduction.

source: Remove Tags
fr: Supprimer les balises

source: When enabled, all the formatting tags are removed from source segments. This is especially useful when dealing with texts where inline formatting is not really useful (e.g., OCRed PDF, bad converted .odt or .docx, etc.) In a normal case it should always be possible to open the target documents, as only inline tags are removed. Non-visible formatting (i.e., which doesn't appear as tags in the OmegaT editor) is retained in target documents.
fr: Lorsque cette option est activée, toutes les balises de formatage sont retirées des segments source. Cela est particulièrement utile pour des textes dont le formatage intégré n'est pas vraiment utile (par exemple des PDF passés par la reconnaissance optique de caractères, des documents .odt ou .docx mal convertis, etc). Normalement, il doit toujours être possible d'ouvrir les documents cibles puisque seuls les balises intégrées sont supprimées. Le formatage non visible (c'est-à-dire qui n'apparaît pas sous forme de balises dans l'Éditeur d'OmegaT) est conservé dans les documents cibles.

source: External Post-processing Command
fr: Commande de post-traitement externe

source: This area allows entering an external post-processing command (for instance, a script to rename files) that will be applied each time Create Translated Documents is used. This external command cannot include "pipes", etc., which is why calling a script is recommended.
fr: Cette zone permet d'entrer une commande de post-traitement externe (par exemple, un script pour renommer des fichiers) qui sera appliquée à chaque utilisation de Créer les documents traduits. Cette commande externe ne pouvant pas comporter de « pipe », etc., l'appel d'un script est recommandé.

source: The segmentation rules are generally valid across all the projects. The user, however, may need to generate a set of rules, specific to the project in question. Use this button to open a dialog, activate the check box Project specific segmentation rules, then proceed to adjust the segmentation rules as desired. The new set of rules will be stored together with the project and will not interfere with the general set of segmentation rules. To delete project specific segmentation rules, uncheck the check box. See `Segmentation Setup preferences <#dialogs.preferences.segmentationsetup>`__ for more information on segmentation rules.
fr: Les règles de segmentation sont généralement valables pour l'ensemble des projets. Cependant, il est possible que l'utilisateur ait besoin de créer un nouvel ensemble de règles qui s'appliqueront spécifiquement au projet en question. Use this button to open a dialog, activate the check box Project specific segmentation rules, then proceed to adjust the segmentation rules as desired. Ce nouvel ensemble de règles sera sauvegardé avec le projet et n'interférera pas avec l'ensemble général de règles de segmentation. Pour supprimer les règles de segmentation spécifiques au projet, décochez la case. See `Segmentation Setup preferences <#dialogs.preferences.segmentationsetup>`__ for more information on segmentation rules.

source: File Filters...
fr: Fichiers et filtres...

source: In a similar fashion as above the user can create project-specific File filters, which will be stored together with the project and will be valid for the current project only. To create a project-specific set of file filters, click on the File filter ...button, then activate Enable project specific filters check box in the window that opens. A copy of the changed filters configuration will be stored with the project. To delete project specific file filters, uncheck the check box. Note that in the menu Options->File Filters, the global user filters are changed, not the project filters. See `File Filters preferences <#dialogs.preferences.filefilters>`__ for more on the subject.
fr: De manière similaire, l'utilisateur peut créer des filtres de fichiers spécifiques au projet qui seront sauvegardés avec le projet et ne seront donc valables que pour le projet en cours. To create a project-specific set of file filters, click on the File filter ...button, then activate Enable project specific filters check box in the window that opens. Une copie des modifications apportées à la configuration des filtres sera sauvegardée avec le projet. Pour supprimer les filtres de fichiers spécifiques au projet, décochez la case. Note that in the menu Options->File Filters, the global user filters are changed, not the project filters. See `File Filters preferences <#dialogs.preferences.filefilters>`__ for more on the subject.

source: Repository Mapping...
fr: Mappage du référentiel...

source: External Search...
fr: Recherche externe...

source: File locations
fr: Emplacement des fichiers

source: Here you can select different subfolders, for instance the subfolder with source files, subfolder for target files etc. If you enter names of folders that do not exist yet, OmegaT creates them for you. In case you decide to modify project folders, keep in mind that this will not move existing files from old folders to the new location.
fr: À cet endroit, vous pouvez sélectionner différents sous-dossiers, par exemple le sous-dossier contenant les fichiers source, le sous-dossier des fichiers cible, etc. If you enter names of folders that do not exist yet, OmegaT creates them for you. Si vous avez décidé de modifier les dossiers du projet, gardez à l'esprit que cela ne déplacera pas les fichiers existants dans les vieux dossiers vers le nouvel emplacement.

source: Clic on Exclusions... to define the files or folders that will be ignored by OmegaT. An ignored file or folder:
fr: Clic on Exclusions... to define the files or folders that will be ignored by OmegaT. Un fichier ou un dossier ignoré :

source: is not displayed in the Editor pane,
fr: n'est pas affiché dans l'Éditeur,

source: is not taken into account in statistics,
fr: n'est pas pris en compte dans les statistiques,

source: is not copied in /target folder during the translated files creation process.
fr: n'est pas copié dans le dossier /target durant le processus de création des fichiers traduits.

source: In the Exclusion patterns dialog, it is possible to Add or Remove a pattern, or edit one by selecting a line and pressing F2. It is possible to use wildcards, using the `ant syntax <https://ant.apache.org/manual/dirtasks.html#patterns>`__.
fr: Dans le dialogue des masques d'exclusion, il est possible d'Ajouter ou de Supprimer un masque, ou d'en modifier un en sélectionnant une ligne et en appuyant sur F2. It is possible to use wildcards, using the `ant syntax <https://ant.apache.org/manual/dirtasks.html#patterns>`__.
