Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/HowTo_TranslatePDF.po
Languages: fr

source: PDF files are a special case. They contain text formatting information, but such information cannot be reused by OmegaT in order to create target files. Thus, PDF files are handled as plain text files, and output files are plain text files.
fr: Les fichiers PDF sont un cas particulier. They contain text formatting information, but such information cannot be reused by OmegaT in order to create target files. Les fichiers PDF sont donc traités comme des fichiers de texte brut et les fichiers de sortie sont aussi au format texte brut.

source: If you need to reproduce text formatting (as well as other things such as drawings) in your translation, there are three ways to try:
fr: Pour reproduire la mise en forme du texte et d'autres éléments, par exemple des graphiques, dans votre traduction, suivez une des trois méthodes suivantes :

source: Use the Iceni Infix filter. See `Howto - Translating PDF files with Iceni Infix and OmegaT <https://omegat.org/howtos/iceni_infix.html>`__.
fr: Utilisez le filtre Iceni Infix. See `Howto - Translating PDF files with Iceni Infix and OmegaT <https://omegat.org/howtos/iceni_infix.html>`__.

source: **Note:** the above information applies only to PDF files with a text layer. If you have a PDF file made of scanned pages (sometimes such files are referred to as ‘dead’ PDFs), you need to use an OCR (optical character recognition) program to recognize the text and convert it to a format that can be handled by OmegaT.
fr: **Note:** the above information applies only to PDF files with a text layer. Si votre fichier PDF se compose de pages numérisées, vous devrez utiliser un programme de reconnaissance optique de caractères (ROC ou, en anglais, OCR) pour reconnaître et convertir le texte dans un format pris en charge par OmegaT.

source: Other file formats
fr: Autres formats de fichier

source: Other plain text or formatted text file formats suitable for processing in OmegaT may also exist.
fr: Il est également possible de trouver d'autres fichiers texte brut ou fichiers texte formaté susceptibles d'être pris en charge par OmegaT.

source: External tools can be used to convert files to supported formats. The translated files will then need to be converted back to the original format. For example, if you have an outdated Microsoft Word version, that does not handle the ODT format, here's a round trip for Word files with the DOC extension:
fr: Des outils externes peuvent être utilisés pour convertir les fichiers dans des formats pris en charge. Les fichiers traduits devront alors être reconvertis dans le format original. Par exemple, si vous possédez une ancienne version de Microsoft Word, qui ne prend pas en charge le format ODT, vous trouverez ici le moyen de permettre aux fichiers Word portant l'extension DOC de faire l'aller-retour :

source: import the file into ODF writer
fr: Importez le fichier dans ODF writer

source: save the file in ODT format
fr: Enregistrez le fichier dans un format ODT

source: translate it into the target ODT file
fr: Traduisez-le dans un fichier ODT cible

source: load the target file in ODF writer
fr: Ouvrez le fichier cible dans ODF Writer

source: save the file as a DOC file
fr: Enregistrez le fichier en tant que fichier DOC

source: The quality of formatting of the translated file will depend on the quality of the round-trip conversion. Before proceeding with such conversions, be sure to test all options. Check the `OmegaT home page <http://www.omegat.org>`__ for an up-to-date listing of auxiliary translation tools.
fr: La qualité du formatage du fichier traduit va dépendre de la qualité de la conversion aller-retour. Avant de procéder à une telle conversion, assurez-vous d'avoir testé toutes les options. Check the `OmegaT home page <http://www.omegat.org>`__ for an up-to-date listing of auxiliary translation tools.
