Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/HowTo_ManageRTL.po
Languages: fr

source: Justification of source and target segments depends upon the project languages. By default, left justification is used for Left-To-Right (LTR) languages and right justification for Right-To-Left (RTL) languages. You can toggle between different display modes by pressing +Shift+ +Ctrl+ +O+ (this is the letter O and not the numeral 0). The +Shift+ +Ctrl+ +O+ toggle has three states:
fr: La justification des segments source et cible dépend des langues du projet. Par défaut, la justification à gauche est utilisée pour les langues qui se lisent de gauche à droite (LTR) et la justification à droite pour les langues qui se lisent de droite à gauche (RTL). You can toggle between different display modes by pressing +Shift+ +Ctrl+ +O+ (this is the letter O and not the numeral 0). The +Shift+ +Ctrl+ +O+ toggle has three states:

source: default justification, that is as defined by the language
fr: La justification par défaut, qui est définie par la langue

source: left justification
fr: La justification à gauche

source: right justification
fr: La justification à droite

source: Using the RTL mode in OmegaT has no influence whatsoever on the display mode of the translated documents created in OmegaT. The display mode of the translated documents must be modified within the application (such as Microsoft Word) commonly used to display or modify them (check the relevant manuals for details). Using +Shift+ +Ctrl+ +O+ causes both text input and display in OmegaT to change. It can be used separately for all three panes (Editor, Fuzzy Matches and Glossary) by clicking on the pane and toggling the display mode. It can also be used in all the input fields found in OmegaT - in the search window, for segmentation rules etc.
fr: Using the RTL mode in OmegaT has no influence whatsoever on the display mode of the translated documents created in OmegaT. Le mode d'affichage des documents traduits doit être modifié dans l'application (par exemple, Microsoft Word) qui est généralement utilisée pour les afficher ou les modifier (consultez les guides correspondants pour plus de détails). Using +Shift+ +Ctrl+ +O+ causes both text input and display in OmegaT to change. Ce mode peut être utilisé pour chacun des trois volets pris séparément (Éditeur, Correspondances et Glossaires) en cliquant sur le volet choisi et en faisant basculer le mode d'affichage. It can also be used in all the input fields found in OmegaT - in the search window, for segmentation rules etc.

source: Mixing RTL and LTR strings in segments
fr: Mélange entre les chaînes RTL et LTR dans les segments

source: When writing purely RTL text, the default (LTR) view may be used. In many cases, however, it is necessary to embed LTR text in RTL text. For example, in OmegaT tags, product names that must be left in the LTR source language, place holders in localization files, and numbers in text. In cases like these it becomes necessary to switch to RTL mode, so that the RTL (in fact bidirectional) text is displayed correctly. It should be noted that when OmegaT is in RTL mode, both source and target are displayed in RTL mode. This means that if the source language is LTR and the target language is RTL, or vice versa, it may be necessary to toggle back and forth between RTL and LTR modes to view the source and enter the target easily in their respective modes.
fr: Lors de la rédaction de texte purement RTL, l'affichage par défaut (LTR) peut être utilisé. Dans de nombreux cas, cependant, il est nécessaire d'intégrer le texte LTR dans un texte RTL. Par exemple, pour les balises OmegaT, pour les noms de produits qui doivent être laissés dans une langue source LTR, pour l'emplacement des supports dans les fichiers de localisation, et pour les numéros dans le texte. Dans des cas comme celui-ci, il est nécessaire de basculer en monde RTL, de sorte que le texte RTL (qui est en fait bidirectionnel) soit affiché correctement. It should be noted that when OmegaT is in RTL mode, both source and target are displayed in RTL mode. Ce qui signifie que si la langue source est une LTR et la langue cible une RTL, ou vice-versa, il sera peut-être nécessaire de basculer régulièrement entre les modes RTL et LTR afin de facilement voir la source et saisir la cible dans leur mode respectif.

source: As stated above, OmegaT tags are LTR strings. When translating between RTL and LTR languages, correctly reading the tags from the source and entering them properly in the target may require the translator to toggle between LTR and RTL modes numerous times.
fr: Comme indiqué ci-dessus, les balises d'OmegaT sont des chaînes LTR. Pour les traductions entre langues RTL et LTR, il peut être nécessaire, pour lire correctement les balises de la source et les entrer correctement dans la cible, que le traducteur bascule un grand nombre de fois entre les modes LTR et RTL.

source: If the document allows, the translator is strongly encouraged to remove style information from the original document so that as few tags as possible appear in the OmegaT interface. Follow the indications given in Hints for tags management. Frequently validate tags (see Tag validation) and produce translated documents (see below and Menu) at regular intervals to make it easier to catch any problems that arise. A hint: translating a plain text version of the text and adding the necessary style in the relevant application at a later stage may turn out to be less hassle.
fr: Si le document le permet, le traducteur est vivement encouragé à retirer un maximum d'informations de style du document original de sorte que le moins de balises possible apparaissent dans l'interface d'OmegaT. Suivez les indications données dans Conseils pour la gestion des balises. De façon générale, validez les balises (voir Validation de balise) et enregistrez les documents traduits (voir ci-dessous et dans le Menu) à intervalles réguliers pour rendre plus facile la résolution des problèmes éventuels. Un conseil : traduire une version texte brut d'un texte et ajouter ultérieurement les styles nécessaires dans l'application appropriée peut s'avérer moins compliqué.

source: Creating translated RTL documents
fr: Création de documents traduits RTL(droite à gauche)

source: When the translated document is created, its display direction will be the same as that of the original document. If the original document was LTR, the display direction of the target document must be changed manually to RTL in its viewing application. Each output format has specific ways of dealing with RTL display; check the relevant application manuals for details.
fr: Lorsque le document traduit est créé, la direction qu'il affiche est la même que celle du document original. Si le document original était en LTR, la direction affichée par le document cible doit être basculée manuellement en RTL dans son application de lecture. Chaque format de sortie gère l'affichage RTL à sa façon ; consultez le guide de l'application appropriée pour plus de détails.

source: For .docx files, a number of changes are however done automatically:
fr: Pour les fichiers .docx, un certain nombre de changements sont cependant effectués automatiquement :

source: Paragraphs, sections and tables are set to bidi
fr: Les paragraphes, les sections et les tableaux sont définis de façon bidirectionnelle

source: Runs (text elements) are set to RTL
fr: Les exécutions (éléments textes) sont définies en RTL

source: To avoid changing the target files display parameters each time the files are opened, it may be possible to change the source file display parameters such that such parameters are inherited by the target files. Such modifications are possible in ODF files for example.
fr: Pour éviter que les paramètres d'affichage des fichiers cible ne changent à chaque fois que les fichiers sont ouverts, il est possible de changer les paramètres d'affichage des fichiers source de sorte que les fichiers cible héritent de ces paramètres. De telles modification sont possibles, par exemple, dans les fichiers ODF.
