Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/Menus_GoTo.po
Languages: fr

source: Next Untranslated Segment
fr: Segment non traduit suivant

source: Moves to the next segment that has no equivalent in the translation memory.
fr: Passe au segment suivant non traduit ( = n'ayant pas d'équivalent dans la mémoire de traduction).

source: Next Translated Segment
fr: Segment traduit suivant

source: Moves to the next already translated segment, ignoring untranslated segments.
fr: Se déplace au prochain segment déjà traduit, ignorant les segments non traduits.

source: Next Segment
fr: Segment suivant

source: Moves to the next segment. If the current segment is the last segment in a file, it moves to the first segment of the next file.
fr: Passe au segment suivant. Si le segment en cours est le dernier segment d'un fichier, on passe au premier segment du fichier suivant.

source: Previous Segment
fr: Segment précédent

source: Moves to the previous segment. If the current segment is the first one in a file, it moves to the last segment of the previous file.
fr: Revient au segment précédent. Si le segment en cours est le premier segment d'un fichier, on passe au dernier segment du fichier précédent.

source: Segment number...
fr: Segment numéro...

source: The segment is opened when either its segment call-out or segment number is entered.
fr: Le segment s'ouvre lorsque son numéro de segment est saisi ou que son raccourci est entré.

source: Next Note
fr: Note suivante

source: The next segment with a note attached to it, will open.
fr: Le segment suivant possédant une note rattachée s'ouvre.

source: Previous Note
fr: Note précédente

source: The previous segment with a note will open.
fr: Le segment précédent possédant une note rattachée s'ouvre.

source: Source of Selected Match
fr: Source de la correspondance sélectionnée

source: Forward in history...
fr: Segment suivant dans l'historique...

source: Back in history...
fr: Segment précédent dans l'historique...
