Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/Menus_Edit.po
Languages: fr

source: Edit
fr: Edition

source: Undo Last Action
fr: Annuler la dernière action

source: Restores the status before the last editing action was taken. This command does not work once the modified segment has been validated.
fr: Restaure le projet pour le rendre tel qu'il était avant la dernière action d'édition effectuée. Cette option ne marche que tant que le segment n'a pas été validé.

source: Redo Last Action
fr: Rétablir la dernière action

source: Restores the status before the last editing action was cancelled. This command does not work once the modified segment has been validated.
fr: Restaure le projet pour le rendre tel qu'il était avant que la dernière action d'édition effectuée n'ait été annulée. Cette option ne marche que tant que le segment n'a pas été validé.

source: Replace With Match or Selection
fr: Remplacer par la correspondance ou la sélection

source: Replaces the whole target segment with the currently selected fuzzy match (by default the first match is selected).
fr: Remplace le segment cible complet par la correspondance sélectionnée (par défaut, c'est la première correspondance qui est sélectionnée).

source: If some texts are selected within the fuzzy match, only this selection will replace the whole target segment.
fr: Si une partie du texte est sélectionnée dans la correspondance partielle, seule cette sélection remplacera l'ensemble du segment cible.

source: Insert Match or Selection
fr: Insérer la correspondance ou la sélection

source: Inserts the currently selected fuzzy match at the cursor position. If part of the target segment has been selected, this function overwrites the selected portion.
fr: Insère la correspondance sélectionnée à l'endroit où se trouve le curseur. Si une partie du segment cible a été sélectionnée, cette fonction remplace la partie sélectionnée par la correspondance.

source: If some texts are selected within the fuzzy match, only this selection will be inserted at the cursor position.
fr: Si une partie du texte est sélectionnée dans la correspondance partielle, seule cette sélection sera insérée à la position du curseur.

source: Replace with Machine Translation
fr: Remplacer par une traduction automatique

source: Replaces the target segment with the translation, provided by the selected Machine Translation service. No action is taken, if no Machine Translation service has been activated (in Options > Machine Translate).
fr: Remplace le segment cible par une traduction automatique fournie par le service de traduction automatique que vous avez choisi. No action is taken, if no Machine Translation service has been activated (in Options > Machine Translate).

source: Replaces the whole target segment with the source.
fr: Remplace le segment cible complet par la source.

source: Insert Source
fr: Insérer le texte source

source: Inserts the source at the cursor position.
fr: Insère la source à l’endroit où se trouve le curseur.

source: Insert Missing Source Tags
fr: Insérer les balises source manquantes

source: Inserts the source tags (if they where missing) at the cursor position.
fr: Insère les balises source (si elles étaient manquantes) à l'endroit où se trouve le curseur.

source: Insert Next Missing Tag
fr: Insérer la prochaine balise manquante

source: Inserts only one tag (among the missing ones) at the cursor position.
fr: N'insère qu'une balise (parmi les manquantes) à l'endroit où se trouve le curseur.

source: Export Selection
fr: Exporter la sélection

source: Exports the current selection to a text file for processing. If no text has been selected, the current source segment is written to this file. When the user exits OmegaT, this file is not emptied, in order to be consistent with usual clipboard behavior. The exported contents are copied to the file ``selection.txt`` located in the User's preference files folder.
fr: Exporte la sélection en cours vers un fichier texte pour la traiter. Si aucun texte n'a été sélectionné, c'est le segment source en cours qui sera envoyé vers ce fichier. When the user exits OmegaT, this file is not emptied, in order to be consistent with usual clipboard behavior. The exported contents are copied to the file ``selection.txt`` located in the User's preference files folder.

source: Create Glossary Entry
fr: Créer une entrée de glossaire

source: Allows the user create an entry in the default glossary file.
fr: Permet à l'utilisateur de créer une entrée dans le fichier glossaire par défaut.

source: Search Project...
fr: Rechercher dans le projet...

source: Search and Replace...
fr: Rechercher et rem&placer...

source: Search Dictionaries
fr: Rechercher dans les dictionnaires

source: Switch case to
fr: Basculer la casse en

source: Changes the case of the highlighted text in the target segment to the selected option (Lower case, Upper case, Title case or Sentence case). Use +Shift+ +F3+ to cycle through the four alternatives. If no text is selected, OmegaT selects the word that contains the letter immediately to the right of the cursor.
fr: Change la casse du texte sélectionné dans le segment cible en fonction de l'option sélectionnée (Minuscule, Majuscule, 1ère lettre des mots en majuscule ou Phrase). Use +Shift+ +F3+ to cycle through the four alternatives. If no text is selected, OmegaT selects the word that contains the letter immediately to the right of the cursor.

source: Select Match
fr: Choisir la correspondance

source: Use as Default Translation
fr: Utiliser comme traduction par défaut

source: If there's several alternative translations available for the active segment, you can label the alternative selected as the default translation. The entry will be greyed, if there's just one translation available.
fr: S'il existe plusieurs traductions possibles pour le segment en cours, vous pouvez définir la traduction choisie comme étant la traduction par défaut. S'il n'y a qu'une traduction possible, l'entrée sera grisée.

source: Create Alternative Translation
fr: Créer une traduction alternative

source: The one and the same segment may, depending on the context, require different translations. Select this menu item, if the current translation does not apply and enter the alternative translation.
fr: Deux segments parfaitement identiques peuvent, en fonction du contexte, avoir deux traductions différentes. Sélectionnez cet élément de menu si la traduction actuelle ne s'applique pas et saisissez la nouvelle traduction

source: Remove Translation
fr: Supprimer la traduction

source: Deletes the translation and set the segment as untranslated.
fr: Supprime la traduction et définit le segment comme non traduit.

source: Set empty translation
fr: Définir traduction vide

source: Define the translation as being empty. In the target document, nothing will appear for this segment. In the Editor, the translation is displayed as <EMPTY>
fr: Définit la traduction comme étant vide. Dans le document cible, rien n'apparaîtra pour ce segment. Dans l'Éditeur, la traduction est affichée sous la forme <VIDE>

source: Register Identical Translation
fr: Enregistrer une traduction identique à la source
