Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/Menus_Project.po
Languages: fr

source: Project
fr: Projet

source: New...
fr: Nouveau...

source: Creates and opens a new project.
fr: Crée et ouvre un nouveau projet.

source: Download Team Project...
fr: Télécharger projet en équipe...

source: Creates a local copy of a remote OmegaT project. See `How to use a team project <#howto.useteamproject>`__ for details.
fr: Crée une copie locale d'un projet distant OmegaT. See `How to use a team project <#howto.useteamproject>`__ for details.

source: Open...
fr: Ouvrir...

source: Opens a previously created project.
fr: Ouvre un projet pré-existant.

source: Open Recent Project
fr: Ou&vrir un projet récent

source: Give access to the ten last edited projects. Clicking on one will save the current project, close it and open the other project.
fr: Give access to the ten last edited projects. Cliquer sur l'un d'entre eux enregistrera le projet actuel, le fermera ou ouvrira l'autre projet.

source: Copy Files to Source Folder...
fr: Copier des fichiers dans le dossier source

source: Download MediaWiki Page...
fr: Télécharger une page MediaWiki...

source: Reload
fr: Recharger

source: Close
fr: Fermer

source: Saves the translation and closes the project.
fr: Enregistre la traduction et ferme le projet.

source: Save
fr: Enregistrer

source: Saves the internal translation memory to the hard disk. OmegaT automatically saves translations every 3 minutes as well as when you close the project or quit OmegaT.
fr: Enregistre la mémoire de traduction interne sur le disque dur. OmegaT automatically saves translations every 3 minutes as well as when you close the project or quit OmegaT.

source: Commit Source Files
fr: Envoyer les fichiers source

source: Commit Target Files
fr: Envoyer les fichiers cible

source: Create Translated Documents
fr: Créer les documents traduits

source: Create Current Translated Document
fr: Créer le document actuel traduit

source: Creates the target document corresponding to the current document in translation.
fr: Crée le document cible correspondant au document actuel traduit.

source: Open MED Project...
fr: Ouvrir projet MED...

source: Properties...
fr: Propriétés...

source: Project Files...
fr: Fichiers du projet...

source: Access Project Contents
fr: Accéder au contenu du projet

source: Gives access to the project folders.
fr: Donne accès aux dossiers du projet

source: In addition, two menu entries allow opening directly the current source and target documents and the writable glossary. The documents are opened by the application chosen by the operating system. If the documents are not available, the entry is greyed out.
fr: De plus, deux entrées de menu permettent d'ouvrir directement les documents source et cible actuels ainsi que le glossaire en écriture. Les documents sont ouverts par l'application choisie par le système d'exploitation. Si les documents ne sont pas disponibles, l'entrée est grisée.

source: Quit
fr: Quitter

source: Saves the project and quits OmegaT. If you haven't yet saved the project, this manually confirms whether you really wish to quit.
fr: Saves the project and quits OmegaT. Si le projet n'a pas encore été enregistré, il vous sera demandé de confirmer manuellement si vous voulez quitter.
