Repository: briacp/omegat-doc-test
Catalog: source/locale/*/LC_MESSAGES/OmegaT4_EditorsPanes.po
Languages: fr

source: The main window consists of several panes, the main menu and a status bar. You can change the position of any pane or even undock it to a separate window by clicking and dragging the pane by its name. Depending on the pane status, different signs can appear at its top right corner:
fr: La fenêtre principale se compose de plusieurs volets, du menu principal et d'une barre d'état. Vous pouvez modifier l'emplacement de n'importe quel volet ou même le détacher dans une fenêtre séparée en cliquant sur le nom du volet et en le faisant glisser. En fonction du statut du volet, des signes différents peuvent être affichés en haut à droite de celui-ci :

source: minimizes the pane, so that only its name is shown at the bottom of the window
fr: réduit le volet de sorte que seul son nom soit visible en bas de la fenêtre

source: maximizes the pane
fr: agrandit le volet

source: restores the layout before the maximizing step
fr: restaure la mise en page qui existait avant l'étape d'agrandissement

source: undocks the pane from the main window
fr: détache le volet de la fenêtre principale

source: puts the pane back within the main window
fr: replace le volet dans la fenêtre principale

source: You can overlap panes if desired. When this is done the panes display a tab at the top. The separators between the panes can be dragged to resize panes. Should you lose track of your changes to the user interface, you can use Options → Restore the main window any time to return to the original layout.
fr: Les volets peuvent se chevaucher si vous le souhaitez. Lorsque cela est fait, les volets affichent un onglet tout en haut. Faites glisser les séparateurs situés entre les volets pour les redimensionner. Should you lose track of your changes to the user interface, you can use Options → Restore the main window any time to return to the original layout.

source: It is possible to drag and drop files to each pane, which will react accordingly.
fr: Il est possible de glisser-déplacer des fichiers sur chaque volet, qui réagira en conséquence.

source: Editor
fr: Éditeur

source: This is where you type and edit your translation. The Editor pane displays the text of the partially translated document: the text already translated is displayed in translation while the untranslated text is displayed in the original language. The displayed text is split into segments and you may scroll through the document and double-click on any segment to open and edit it. In the above case, the segments already translated are shown in yellow.
fr: Volet dans lequel vous tapez et modifiez votre traduction. Le volet Éditeur affiche le texte du document partiellement traduit : le texte déjà traduit est affiché dans sa traduction tandis que le texte non traduit reste dans sa langue d'origine. Le texte affiché est séparé en segments. Vous pouvez faire défiler le document et double-cliquer sur n'importe quel segment pour l'ouvrir et le modifier. Dans le cas ci-dessus, les segments déjà traduits sont affichés en jaunes.

source: One of the above segments is the current segment. It is the segment that is displayed in two parts. The upper part is in the source language, in bold characters with a green background color, the lower part is the editing field, ended by a marker: the marker is ``<segment nnnn>`` where nnnn is a number of the segment in the project. Use the upper part as a reference and replace or modify the contents of the editing field with your translation.
fr: Un des segments ci-dessus est le segment en cours. Il s'agit du segment qui est affiché en deux parties. The upper part is in the source language, in bold characters with a green background color, the lower part is the editing field, ended by a marker: the marker is ``<segment nnnn>`` where nnnn is a number of the segment in the project. Utilisez la partie supérieure comme référence et remplacez ou modifiez son contenu par votre traduction dans la ligne d'édition.

source: Depending upon the preferred editing behavior, the editing field for the untranslated segment may be empty, contain the source text, or contain the translation of the string most similar to the one to be translated. When you move to another segment, the translation is validated and stored. If you want the translation to be the same as the source, simply make the editing field empty by removing all the text (select all with Ctrl+A and delete with Del). OmegaT is able to store translations that are identical to the source. This is useful for documents that contain trade marks, names or other proper nouns, or parts in a third language that do not require translation. See *Translation editing* for more details.
fr: En fonction du comportement que vous avez choisi pour la ligne d'édition, pour un segment non traduit celle-ci peut être : vide, contenir le texte source ou contenir la traduction de la chaîne de caractères la plus proche de celle que vous êtes en train de traduire. Lorsque vous passez au segment suivant, la traduction est validée et sauvegardée. If you want the translation to be the same as the source, simply make the editing field empty by removing all the text (select all with Ctrl+A and delete with Del). OmegaT est capable d'enregistrer les traductions qui sont identiques à la source. Ceci est utile pour les documents qui contiennent des noms de marque, des noms propres, ou des parties qui sont dans une troisième langue et n'ont pas besoin d'être traduites. See *Translation editing* for more details.

source: It is possible to drag text from anywhere in the main window and to drop it within the segment. Texted dragged from outside the target segment is copied, while text dragged from within the segment is moved.
fr: Il est possible de faire glisser du texte depuis un endroit quelconque de la fenêtre principale et de le déposer dans le segment. Le texte provenant de l'extérieur du segment cible est copié, le texte en provenance du segment est déplacé.

source: By default, it is not possible to select words in the source segment using the keyboard rather than the mouse. Pressing F2 key allows to move the cursor into the source segment (or anywhere in the editor) with the keyboard arrows. In this mode, "Cursor lock off" is displayed at the bottom of the pane. To come back to the standard mode "Cursor lock on", press F2 again.
fr: Par défaut, il n'est pas possible de sélectionner des mots dans le segment source à l'aide du clavier plutôt que de la souris. Pressing F2 key allows to move the cursor into the source segment (or anywhere in the editor) with the keyboard arrows. In this mode, "Cursor lock off" is displayed at the bottom of the pane. To come back to the standard mode "Cursor lock on", press F2 again.

source: Fuzzy Matches
fr: Correspondances

source: The match viewer shows the most similar segments from translation memories, both from internal project translation memory created in real time as you translate your project and from ancillary translation memories you have imported from your earlier jobs, or received from your client or translation agency.
fr: Le volet Correspondances affiche les segments les plus proches provenant de la mémoire de traduction interne au projet qui est créée en temps réel au cours de votre traduction et des mémoires de traduction secondaires que vous avez importées depuis vos travaux précédents ou que vous avez reçues de la part de votre client ou de votre agence de traduction.

source: When you move to the next segment, the first fuzzy match (the one with the best matching percentage) is automatically selected. You may select a different match by pressing Ctrl+2, 3, 4, or 5. Of course, pressing +Ctrl+ +5+ will have no effect, if there is no match #5. To use the selected match in your translation, use Ctrl+R to replace the target field with the match or use Ctrl+I to insert it at the cursor position.
fr: Lorsque vous passez au segment suivant, la première correspondance (celle ayant le meilleur pourcentage de correspondance) est sélectionnée automatiquement. You may select a different match by pressing Ctrl+2, 3, 4, or 5. Of course, pressing +Ctrl+ +5+ will have no effect, if there is no match #5. To use the selected match in your translation, use Ctrl+R to replace the target field with the match or use Ctrl+I to insert it at the cursor position.

source: The matching percentage is roughly equivalent to taking the number of common words in the matched and the matching segment and dividing by the number of words in the longer of the two. The selected fuzzy match is highlighted in bold, words that are missing in the segment you are translating are colored blue and words adjacent to the missing parts green. In the above example the source segment is **Context menu command**. The top match is 100%, because all words match. So do the next two matches, and the match #4 is similar, but different. The line with the matching percentage also includes the name of the translation memory containing the match. If there's no file name displayed, the source is the internal project translation memory. Orphan segments (the match #2) describe segments in the default project translation memory that have no corresponding source segment.
fr: Le pourcentage de correspondances correspond à peu près au nombre de mots communs dans les deux segments correspondants divisé par le nombre de mots présents dans le segment le plus long des deux. La correspondance sélectionnée est mise en gras, les mots qui sont absents dans le segment que vous traduisez sont en bleu et les mots qui entourent les parties manquantes sont en vert. In the above example the source segment is **Context menu command**. La meilleure correspondance est de 100 % car tous les mots correspondent. C'est la même chose pour les deux correspondances suivantes. La correspondance n° 4 est proche, mais présente des différences. The line with the matching percentage also includes the name of the translation memory containing the match. Si aucun nom de fichier n'est affiché, cela signifie que la source est la mémoire de traduction interne au projet. Orphan segments (the match #2) describe segments in the default project translation memory that have no corresponding source segment.

source: Glossary
fr: Glossaires

source: The Glossary pane allows you to access your own collection of expressions and specialist terminology which you have built up in your glossary files. It shows translation of terms found in the current segment. The source segment in the example below was “\ *Context menu command*\ ”, as in the Fuzzy Matches example above, and the terms shown were found in the glossaries, available (Microsoft's Term collection and Slovenian Linux User group Glossary).
fr: Le volet Glossaires vous permet d'accéder à votre propre collection d'expressions et de terminologies spécialisées (que vous avez créées et enregistrées dans vos fichiers glossaires). Il montre la traduction des termes présents dans le segment en cours. The source segment in the example below was “\ *Context menu command*\ ”, as in the Fuzzy Matches example above, and the terms shown were found in the glossaries, available (Microsoft's Term collection and Slovenian Linux User group Glossary).

source: If you have TransTips option activated (Options → TransTips), you can right click on the highlighted word in the source segment to open a pop-up menu with suggested translation, as offered by your glossary. Selecting one of them will insert it at the current cursor position into the target segment. You can also highlight your preferred alternative in the glossary pane and insert it into the target by right clicking on the selection.
fr: If you have TransTips option activated (Options → TransTips), you can right click on the highlighted word in the source segment to open a pop-up menu with suggested translation, as offered by your glossary. Sélectionner l'une de ces traductions permet de l'insérer à l'endroit où se trouve le curseur dans le segment cible. Il est également possible de surligner votre alternative préférée dans le volet Glossaires et de l'insérer dans le segment cible avec un clic droit sur la sélection.

source: Dictionary
fr: Dictionnaires

source: Dictionaries are the electronic equivalents of printed dictionaries like Merriam Webster, Duden, Larousse etc., that you may have on your desk. See more about them in the chapter on `Dictionaries <#appendix.dictionaries>`__
fr: Les dictionnaires sont les équivalents électroniques des dictionnaires papier (comme Merriam Webster, Duden, Larousse etc.) que vous pouvez avoir sur votre bureau. See more about them in the chapter on `Dictionaries <#appendix.dictionaries>`__

source: Machine Translation
fr: Traduction automatique

source: The machine translation pane, when opened, contains the suggestions by machine translation tools for the current segment. Press Ctrl+M to replace the translation of the current segment with the suggested translation.
fr: Le volet Traduction automatique, lorsqu'il est ouvert, contient les suggestions de traduction proposées par les outils de traduction automatique pour le segment en cours. Press Ctrl+M to replace the translation of the current segment with the suggested translation.

source: Multiple Translations
fr: Traductions multiples

source: A given source segment may require several different translations, depending on the context. If the current translation of the segment does not fit, the user can select Edit → Create Alternative Translation. The target text entered after that will be treated as an alternative translation of the source segment. You can define one of the alternative - for instance the most probable among them - as default translation by selecting Edit → Use as Default Translation
fr: Un même segment source peut avoir différentes traductions en fonction du contexte. If the current translation of the segment does not fit, the user can select Edit → Create Alternative Translation. Le segment cible saisi après cette action sera alors considéré comme une traduction alternative pour le segment source. You can define one of the alternative - for instance the most probable among them - as default translation by selecting Edit → Use as Default Translation

source: The translator can add notes to the opened segment, for instance to come back later to the segment and redo the translation, check that alternative translations are correct or to ask colleagues for their opinion. You can browse through notes using GoTo → Next Note and GoTo → Previous Note.
fr: Le traducteur peut adjoindre des notes au segment en cours, ce qui lui permet, par exemple, d'y revenir plus tard et de refaire sa traduction, de vérifier que les traductions alternatives sont correctes ou d'interroger ses collègues pour avoir leur avis. You can browse through notes using GoTo → Next Note and GoTo → Previous Note.

source: Comments
fr: Commentaires

source: Some of the file formats, specialized for translation work, for instance PO, allow the inclusion of comments. This way the translator can be provided the context about the segment to be translated. In the example below, the author of the PO file included a warning for the translator to check the length of the translation:
fr: Certains formats de fichiers conçus spécialement pour le travail de traduction (ex : les fichiers PO) permettent l'ajout de commentaires. De cette façon, le traducteur peut obtenir le contexte entourant le segment à traduire. Dans l'exemple ci-dessous, l'auteur du fichier PO a intégré un avertissement afin que le traducteur vérifie la longueur de la traduction :

source: Status bar
fr: Barre d'état

source: The status bar displays work-flow related messages at the bottom of the main window. This bar gives the user feedback on specific operations that are in progress. It also displays the number of fuzzy and glossary matches for the current segment.
fr: La barre d'état affiche les messages relatifs au flux de travail dans le bas de la fenêtre principale. Cette barre donne à l'utilisateur un retour concernant certaines opérations spécifiques en cours. Elle affiche également le nombre de correspondances partielles et de correspondances de glossaire pour le segment en cours.

source: The counters in the lower right corner keep track of the progress of the translation (numbers in the left hand column refer to the figure above):
fr: Le compteur localisé dans le coin inférieur bas suit la progression de la traduction (les nombres de la colonne de gauche correspondent à l'image ci-dessus) :

source: number of segments - translated vs total for the current file
fr: Nombre de segments traduits / Nombre total de segments du fichier en cours

source: number of unique segments - translated vs total in the project
fr: nombre de segments uniques traduits / nombre total de segments uniques du projet

source: total number of segments (including repeats) in the project
fr: Nombre total de segments du projet (y compris les répétitions)

source: number of source and target characters in the current segment
fr: Nombre de caractères source / nombre de caractères cible dans le segment en cours

source: From a practical point of view, the most important pair of numbers is the second pair: it tells, how much you have done so far, in relation to the total or second number. The project in the example is evidently finished, as all the unique segments have been translated.
fr: D'un point de vue pratique, le couple de nombres le plus important est le second : il vous dit quelle quantité de travail a déjà été effectuée par rapport au total ou au nombre de segments uniques. Dans l'exemple, le projet est bien sûr finit puisque tous les segments uniques ont été traduits.
